{
  "retirement": "Every eligible employee can contribute between 1% and 100% of their salary to the 401(k) plan, up to the annual IRS limits, which are $23,000 for 2024 or $30,500 if you're 50 or older and eligible for catch-up contributions. TechLance's matching formula provides a dollar-for-dollar match on your first 4% of salary contributions, plus an additional 50% match on your next 2% of contributions. This means if you contribute 6% of your salary, TechLance will contribute 5%, creating total annual retirement savings of 11% of your salary. Company matching vests gradually over five years: 20% after one year, 40% after two years, 60% after three years, 80% after four years, and 100% after five years of service. TechLance automatically enrolls all eligible employees at 4% of salary starting the first day of the month following 90 days of employment. The plan includes automatic escalation, increasing your contribution rate by 1% each year on your hire date anniversary, up to 10% of your salary. Investment options include target-date funds, low-cost index funds with expense ratios from 0.05% to 0.25%, and self-directed brokerage option. Both traditional (pre-tax) and Roth (after-tax) 401(k) options are available.",
  
  "childcare": "TechLance operates an on-site childcare center, Little Learners, located on the ground floor of our main building. The center is open Monday through Friday from 7:00 AM to 6:30 PM and is accredited by the National Association for the Education of Young Children (NAEYC). The facility serves children from six weeks of age through school age, with capacity for approximately 120 children across all age groups. Due to popularity, there is currently a waiting list for most age groups, with infant care typically having the longest wait time of 18 to 24 months. TechLance offers financial assistance programs with monthly reimbursements for qualified childcare expenses: employees with household incomes below $75,000 may receive up to $600 per child per month, while those earning between $75,000 and $150,000 receive scaled assistance ranging from $100 to $400 monthly per child. Emergency childcare fund provides up to $200 per incident and $600 annually for backup care situations. Partnership with Bright Horizons provides backup childcare services at $5 per child per day, with in-home backup care available at $10 per hour per family. Summer Discovery Camp serves children ages 5-12 for ten weeks from June through August, costing $200 per week per child.",
  
  "gym": "TechLance has negotiated corporate rates with fitness centers across three tiers, providing different levels of savings based on the type of facility and services offered. Tier 1 partners offer 50% off regular membership rates and include nationally recognized chains such as 24 Hour Fitness, LA Fitness, Planet Fitness, and selected local community centers. Tier 2 partners provide 35% discounts and include premium fitness facilities such as Equinox, Orange Theory, Pure Barre, SoulCycle, and YMCA locations. Tier 3 partners offer 25% discounts and encompass boutique studios specializing in specific activities such as yoga, Pilates, martial arts, rock climbing, CrossFit boxes, and sports-specific facilities. Fitness benefits extend to employees' family members, with spouses and domestic partners receiving the same discount rates as employees. Dependent children under 18 receive an additional 10% discount on youth programs and classes. Payroll deduction is available using pre-tax dollars through Flexible Spending Account program. Most partner locations provide guest privileges, typically allowing two guest passes per month at standard partner facilities.",
  
  "healthcare": "Three health plan options are available: PPO plan ($89/month employee, $245 family) offers greatest flexibility in choosing healthcare providers without referrals to see specialists. HMO plan ($45/month employee, $189 family) provides comprehensive coverage through coordinated care with primary care physician coordination. High Deductible Health Plan (HDHP) ($32/month employee, $134 family) is paired with Health Savings Account for tax-advantaged savings. All plans include comprehensive preventive care at no cost when using in-network providers, including annual physical exams, routine immunizations, cancer screenings, women's health exams, well-child visits, and annual vision and hearing tests. TechLance employees enrolled in HDHP are eligible to contribute up to $4,150 annually for individual coverage or $8,300 for family coverage to Health Savings Account, with TechLance contributing $750 annually for individual HDHP coverage and $1,500 for family coverage. Wellness program offers opportunities to earn up to $300 annually in HSA contributions or health insurance premium credits. All employees have access to telemedicine services at no cost, available 24/7 for non-emergency medical issues.",
  
  "life_insurance": "Every eligible TechLance employee automatically receives basic life insurance coverage equal to one times their annual base salary, with a maximum benefit of $100,000. This coverage is provided at no cost and begins on your first day of employment with no waiting period or medical requirements. The basic life insurance coverage also includes an equal amount of accidental death and dismemberment (AD&D) coverage at no additional cost. Voluntary supplemental life insurance allows you to purchase additional coverage beyond the basic amount, available in increments of $10,000, ranging from $50,000 to $500,000, with maximum total coverage of five times your annual salary or $1,000,000, whichever is less. Cost is based on age and tobacco use, with rates calculated per $1,000 of coverage per month. For coverage amounts up to $150,000, no medical exam or health questions are required if you enroll within 30 days of becoming eligible. Spouse coverage is available in amounts of $10,000, $25,000, $50,000, or $75,000, though total amount cannot exceed 50% of your own life insurance coverage. Dependent child coverage is available for children from 14 days old through age 26, with coverage amounts of $5,000 or $10,000 per child, costing only $2-4 per month regardless of how many children you have."
}